üü¶ 1. Import Libraries

In [1]:
import pandas as pd
import numpy as np

üü¶ 2. Sample Dataset

In [4]:
df = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 90, 95],
    'Science': [88, 92, 84],
    'English': [91, 85, 89]
})

df

   Student  Math  Science  English
0    Alice    85       88       91
1      Bob    90       92       85
2  Charlie    95       84       89

üü¶ 3. Basic melt() ‚Äî Convert Wide ‚Üí Long

In [5]:
melted = pd.melt(df, id_vars='Student')
melted

   Student variable  value
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     88
4      Bob  Science     92
5  Charlie  Science     84
6    Alice  English     91
7      Bob  English     85
8  Charlie  English     89

üü¶ 4. Rename Melted Columns (var_name & value_name)

In [6]:
melted_named = pd.melt(
    df,
    id_vars='Student',
    var_name='Subject',
    value_name='Score'
)

melted_named

   Student  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     88
4      Bob  Science     92
5  Charlie  Science     84
6    Alice  English     91
7      Bob  English     85
8  Charlie  English     89

üü¶ 5. Melt Multiple ID Columns

In [7]:
#add a new column
df2 = df.copy()
df2['Class'] = ['A', 'A', 'B']

#melt with two columns
pd.melt(df2, id_vars=['Student', 'Class'],
        var_name='Subject', value_name='Score')

   Student Class  Subject  Score
0    Alice     A     Math     85
1      Bob     A     Math     90
2  Charlie     B     Math     95
3    Alice     A  Science     88
4      Bob     A  Science     92
5  Charlie     B  Science     84
6    Alice     A  English     91
7      Bob     A  English     85
8  Charlie     B  English     89

üü¶ 6. Melt Multiple Value Columns

In [9]:
df3 = pd.DataFrame({
    'Student': ['Ali', 'Reza'],
    'Math_Score': [80, 90],
    'Math_Grade': ['B', 'A'],
    'Science_Score': [85, 92],
    'Science_Grade': ['B+', 'A-']
})

df3

  Student  Math_Score Math_Grade  Science_Score Science_Grade
0     Ali          80          B             85            B+
1    Reza          90          A             92            A-

In [15]:
melted_multi = pd.melt(
    df3,
    id_vars='Student',
    value_vars=['Math_Score', 'Math_Grade', 'Science_Score'],
    var_name='Subject_Metric',
    value_name='Value'
)

melted_multi

  Student Subject_Metric Value
0     Ali     Math_Score    80
1    Reza     Math_Score    90
2     Ali     Math_Grade     B
3    Reza     Math_Grade     A
4     Ali  Science_Score    85
5    Reza  Science_Score    92

üü¶ 7. Extract Information After Melt

In [16]:
split_df = melted_multi.copy()
split_df[['Subject', 'Metric']] = split_df['Subject_Metric'].str.split('_', expand=True)
split_df

  Student Subject_Metric Value  Subject Metric
0     Ali     Math_Score    80     Math  Score
1    Reza     Math_Score    90     Math  Score
2     Ali     Math_Grade     B     Math  Grade
3    Reza     Math_Grade     A     Math  Grade
4     Ali  Science_Score    85  Science  Score
5    Reza  Science_Score    92  Science  Score

üü¶ 8. Keep Only Selected Columns (Dropping Others)

In [17]:
pd.melt(df, value_vars=['Math', 'Science'])

  variable  value
0     Math     85
1     Math     90
2     Math     95
3  Science     88
4  Science     92
5  Science     84

## üü¶ Summary

In this subsection, you learned how to:

‚úîÔ∏è Convert wide ‚Üí long using pd.melt()

‚úîÔ∏è Customize variable/value names

‚úîÔ∏è Melt multiple identifier and value columns

‚úîÔ∏è Reshape time-series datasets

‚úîÔ∏è Split melted variable names into multiple columns

‚úîÔ∏è Use value_vars to limit which columns are melted